### Terraform Plan - Production 🪐
- Terraform Format and Style 🖌: `success`
- Terraform Initialization ⚙️: `success`
- Terraform Validation 🤖: `success`
- Terraform Plan 📖: `success`

<details><summary>Show Plan</summary>

```terraform Acquiring state lock. This may take a few moments...
cloudflare_record.socket: Refreshing state... [id=98b363905c2efdf7a730dc754d7a680f]
cloudflare_zone_settings_override.tarkov_dev: Refreshing state... [id=a17204c79af55fcf05e4975f66e2490e]
cloudflare_record.assets: Refreshing state... [id=fa9d45fc579f68883bce2b2e2bf4e378]
cloudflare_record.manager: Refreshing state... [id=2e208b66455795c12afd59021c56d891]
cloudflare_record.dev_api: Refreshing state... [id=2cf1e8e4b922e8bce1ec023b64d04278]
cloudflare_rate_limit.tarkov_dev: Refreshing state... [id=cbe28fcfa5ec4a6ab50abad705200d9d]
cloudflare_record.www: Refreshing state... [id=c9b09dbb4885589e1d7a7ed17f0b7bc8]
cloudflare_record.root: Refreshing state... [id=58772b98e3e902db650041cbe2262633]
cloudflare_record.status: Refreshing state... [id=8b78ff4373eb3ed0fedc73ee511c4168]
cloudflare_zone.tarkov_dev: Refreshing state... [id=a17204c79af55fcf05e4975f66e2490e]
cloudflare_record.api: Refreshing state... [id=5a6f0c44f89893d479067808915a429f]
cloudflare_record.market: Refreshing state... [id=c0e350a380953cdff74f16c911b3c595]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_record.test will be created
  + resource "cloudflare_record" "test" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "test"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "A"
      + value           = "209.151.146.50"
      + zone_id         = "a17204c79af55fcf05e4975f66e2490e"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

> Pusher: @GrantBirki, Action: `pull_request`, Working Directory: `terraform/`, Workflow: `ci`